app/controllers/posts_controller.rb

SELECT * FROM `posts` ORDER BY created_at DESC
SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.id = `taggings`.tag_id WHERE ((`taggings`.taggable_type = 'Post') AND (`taggings`.taggable_id = 1))
---
  def index
    @comment = Comment.new
    @posts = Post.all(:order => 'created_at DESC')

    respond_to do |format|
      format.html do # index.html.erb
        if params[:tag]
          @posts = Post.find_tagged_with(params[:tag], :order => "created_at DESC")