app/controllers/projects_controller.rb

  def index
    @projects = Project.paginate(:page => params[:page], :per_page => 2, :order => 'created_at DESC')
---
SELECT * FROM "projects" ORDER BY created_at DESC LIMIT 2 OFFSET 0
SELECT count(*) AS count_all FROM `projects`